package com.c1k4d4.tasks.week4.encapsulation;

/*
 * Неделя 4.
 * Задание 1.
 * Создать класс, описывающий банкомат.
 * Банкомат задается тремя свойствами:
 * -количеством купюр номиналом 10, 20 и 50.
 * Создать конструктор с тремя параметрами - количеством купюр каждого номинала.
 * Сделать методы для добавления денег в банкомат.
 * Сделать метод, снимающий деньги: он принимает сумму денег, а возвращает булево
 * значение - успешность выполнения операции. При снятии денег метод должен распечатывать
 * каким количеством купюр какого номинала выдаётся сумма. Сначала банкомат будет пытаться
 * рассчитаться 50, далее добавит недостающие 20, и только затем 10 (не нужно рассматривать
 * более сложные варианты выдачи наличных, чтобы не усложнять алгоритм).
 */

import com.c1k4d4.tasks.week4.encapsulation.atm.ATM;

import static com.c1k4d4.tasks.week4.encapsulation.atm.ATMTester.*;

public class Task1Runner {

    public static void main(String[] args) {

        /* запускать любой из тестов */
        runPositiveTest1();
        System.out.println();

//        runPositiveTest2();
//        System.out.println();
//
//        runNegativeTest1();
//        System.out.println();
//
//        runNegativeTest2();
//        System.out.println();
    }
}
